UCB_CS61_lec29.org
* GRAPHS (BFS)
Breadth-first search (BFS) is a little more complicated than depth-first search,
because it's not naturally recursive. We use a _queue_ so that vertices are
visited in order according to their distance from the starting vertex. BFS is a
lot like level-order tree traversal.

#+BEGIN_EXAMPLE
  public void bfs(Vertex u) {                                                   //       initial *
    for (each vertex v in V) {                                   // O(|V|) time //               |
      v.visited = false;                                                        //-+             v 访问
    }                                                                           // |             |
    u.visit(null);                            // Do some unspecified thing to u // |             v
    u.visited = true;                              // Mark the vertex u visited // |             进队:enqueue 求子
    q = new Queue();                                            // New queue... // |             |
    q.enqueue(u);                                  // ...initially containing u // |             v
    while (q is not empty) {                // With adjacency list, O(|E|) time // |  +--------> 出队:dequeue 得子
      v = q.dequeue();                                                          // |  |          |
      for (each vertex w such that (v, w) is an edge in E) {                    // |  |          +-------------------------------+ queue build (for-loop)
        if (!w.visited) {                                                       // |  |          |   |->|  |->|  |->|   ......   |
          w.visit(v);                         // Do some unspecified thing to w //-+  |          v   |  v  |  v  |  v            v
          w.visited = true;                        // Mark the vertex w visited // |  |         子 1 访问 子 2 访问 子 3 访问子 4 访问       子 n 访问
          q.enqueue(w);                                                         // |  |          |  /   |  /  |  /  |            |
        }                                                                       // |  |          v /    v /   v /   v            v
      }                                                                         // |  |        进队/    进/   进/    进队         进队
    }                                                                           // |  +----------+ queue FIFO (while-loop)
  }                                                                             // | 整体就是 访问-->儿子队：循环(求子->访问子->子进队)-->出子->访问
                                                                                   |
                                         public class Vertex {                     |
                                           protected Vertex parent;                |
                                           protected int depth;                    |
Notice that when we visit a vertex,        protected boolean visited;              |
we pass the edge's origin vertex                                                   |
as a parameter.  This allows us to       public void visit(Vertex origin) {    <---+
do a computation such as finding           this.parent = origin;
the distance of the vertex from            if (origin == null) {
the starting vertex, or finding              this.depth = 0;
the shortest path between them.            } else {
The visit() method at right                  this.depth = origin.depth + 1;
accomplishes both these tasks.             }
                                         }
                                       }
                                                                      +-4--+
                                                           forbidden  X    |
                                                                      |    |
                                                                      v  --3
                                                                    __2     \3
注意这里是如何保证每个 node 存储的都是最短路径？                          _1    \2    \3
1. 首先利用 queue 确保层层推进; 越先访问的，路径越短;                      \1   |2    |3
2. 其次利用 visited 保证每个 node's depth 只被写入一次;                *  |1   |2    |3
   所以后访问的，想改写前面 node's depth 是 forbidden 的;                /1   /2    /3
                                                                    --2     /3
                                                                        ---3
  #+END_EXAMPLE


When an edge (v, w) is traversed to visit a Vertex w, _the depth of w is set to_
_the depth of v plus one_, and v is set to become the _parent_ of w.

The sequence of figures below shows BFS running on the city adjacency graph
(Albany, Kensington, Emeryville, Berkeley, Oakland, Piedmont) from last
lecture, starting from Albany.  A "V" is currently visited; a digit shows the
depth of a vertex that is marked visited; a "*" is a vertex which we try to
visit but discover has already been visited.  Underneath each figure of the
graph, I depict the queue and the current value of the variable "v" in bfs().

#+BEGIN_EXAMPLE
V-K  0-V  0-1  *-1  0-1  *-1  0-*  0-1  0-1  0-1  0-1  0-1  0-1  0-1  0-1  0-1
 \|   \|   \|   \|   \|   \|   \|   \|   \|   \|   \|   \|   \|   \|   \|   \|
E-B  E-B  E-V  E-1  E-*  E-1  E-1  V-1  2-1  2-*  2-1  *-1  2-*  2-1  2-1  2-1
|/   |/   |/   |/   |/   |/   |/   |/   |/   |/   |/   |/   |/   |/   |/   |/
O-P  O-P  O-P  O-P  O-P  O-P  O-P  O-P  V-P  2-P  *-P  2-P  2-P  2-V  *-3  2-3

===  ===  ===  ===  ===  ===  ===  ===  ===  ===  ===  ===  ===  ===  ===  ===
A    K    KB   B    B              E    EO   O    O              P
===  ===  ===  ===  ===  ===  ===  ===  ===  ===  ===  ===  ===  ===  ===  ===
     v=A  v=A  v=K  v=K  v=B  v=B  v=B  v=B  v=E  v=E  v=O  v=O  v=O  v=P

#+END_EXAMPLE

#+BEGIN_EXAMPLE
After we finish, we can find the shortest path from any vertex to the     0<--1
starting vertex by following the parent pointers (right).  These           ^
pointers form a tree rooted at the starting vertex.  Note that they         \
point in the direction _opposite_ the search direction that got us there.    \
                                                                          2-->1
Why does this work?  The starting vertex is enqueued first, then all the     ^
vertices at a distance of 1 from the start, then all the vertices at a      /
distance of 2, and so on.  Why?  When the starting vertex is dequeued,     /
all the vertices at a distance of 1 are enqueued, but no other vertex     2<--3
is.  When the depth-1 vertices are dequeued and processed, all the
vertices at a distance of 2 are enqueued, because every vertex at a distance of
2 must be reachable by a single edge from some vertex at a distance of 1.  No
other vertex is enqueued, because every vertex at a distance less than 2 has
been marked, and every vertex at a distance greater than 2 is not reachable by
a single edge from some vertex at a distance of 1.

#+END_EXAMPLE

*Recommendation*: pull out a piece of paper, draw a graph and a program stack,
and simulate BFS, with you acting as the computer and executing bfs() line by
line. You will understand it much better after taking the time to do this.

BFS, like DFS, runs in ~O(|V| + |E|)~ time if you use an adjacency list;
~O(|V|^2)~ time if you use an adjacency matrix.

