UCB_CS61_lec29.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-09 四 21:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>第二十九课 Graph-BFS</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yiddishkop" />
<link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
</head>
<body>
<div id="content">
<h1 class="title">第二十九课 Graph-BFS</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge0dce4d">1. GRAPHS (BFS)</a></li>
<li><a href="#org7708422">2. Weighted Graphs</a></li>
<li><a href="#org9b3f66d">3. [greedy algo]Kruskal's Algorithm for Finding Mimumum Spanning Trees           </a></li>
<li><a href="#orgcfd5425">4. [greedy algo]Prim's Algo for Finding minimum spanning tree</a></li>
<li><a href="#orgd11de02">5. Shortest path tree and Distances</a></li>
</ul>
</div>
</div>


<div id="orge0dce4d" class="outline-2">
<h2 id="orge0dce4d"><span class="section-number-2">1</span> GRAPHS (BFS)</h2>
<div class="outline-text-2" id="text-1">
<p>
Breadth-first search (BFS) is a little more complicated than depth-first search,
because it's not naturally recursive. We use a <span class="underline">queue</span> so that vertices are
visited in order according to their distance from the starting vertex. BFS is a
lot like level-order tree traversal.
</p>

<pre class="example">
  public void bfs(Vertex u) {                                                   //       initial *
    for (each vertex v in V) {                                   // O(|V|) time //               |
      v.visited = false;                                                        //-+             v 访问
    }                                                                           // |             |
    u.visit(null);                            // Do some unspecified thing to u // |             v
    u.visited = true;                              // Mark the vertex u visited // |             进队:enqueue 求子
    q = new Queue();                                            // New queue... // |             |
    q.enqueue(u);                                  // ...initially containing u // |             v
    while (q is not empty) {                // With adjacency list, O(|E|) time // |  +--------&gt; 出队:dequeue 得子
      v = q.dequeue();                                                          // |  |          |
      for (each vertex w such that (v, w) is an edge in E) {                    // |  |          +-------------------------------+ queue build (for-loop)
        if (!w.visited) {                                                       // |  |          |   |-&gt;|  |-&gt;|  |-&gt;|   ......   |
          w.visit(v);                         // Do some unspecified thing to w //-+  |          v   |  v  |  v  |  v            v
          w.visited = true;                        // Mark the vertex w visited // |  |         子 1 访问 子 2 访问 子 3 访问子 4 访问       子 n 访问
          q.enqueue(w);                                                         // |  |          |  /   |  /  |  /  |            |
        }                                                                       // |  |          v /    v /   v /   v            v
      }                                                                         // |  |        进队/    进/   进/    进队         进队
    }                                                                           // |  +----------+ queue FIFO (while-loop)
  }                                                                             // | 整体就是 访问--&gt;儿子队：循环(求子-&gt;访问子-&gt;子进队)--&gt;出子-&gt;访问
                                                                                   |
                                         public class Vertex {                     |
                                           protected Vertex parent;                |
                                           protected int depth;                    |
Notice that when we visit a vertex,        protected boolean visited;              |
we pass the edge's origin vertex                                                   |
as a parameter.  This allows us to       public void visit(Vertex origin) {    &lt;---+
do a computation such as finding           this.parent = origin;
the distance of the vertex from            if (origin == null) {
the starting vertex, or finding              this.depth = 0;
the shortest path between them.            } else {
The visit() method at right                  this.depth = origin.depth + 1;
accomplishes both these tasks.             }
                                         }
                                       }
                                                                      +-4--+
                                                           forbidden  X    |
                                                                      |    |
                                                                      v  --3
                                                                    __2     \3
注意这里是如何保证每个 node 存储的都是最短路径？                          _1    \2    \3
1. 首先利用 queue 确保层层推进; 越先访问的，路径越短;                      \1   |2    |3
2. 其次利用 visited 保证每个 node's depth 只被写入一次;                *  |1   |2    |3
   所以后访问的，想改写前面 node's depth 是 forbidden 的;                /1   /2    /3
                                                                    --2     /3
                                                                        ---3
</pre>


<p>
When an edge (v, w) is traversed to visit a Vertex w, <span class="underline">the depth of w is set to</span>
<span class="underline">the depth of v plus one</span>, and v is set to become the <span class="underline">parent</span> of w.
</p>

<p>
The sequence of figures below shows BFS running on the city adjacency graph
(Albany, Kensington, Emeryville, Berkeley, Oakland, Piedmont) from last
lecture, starting from Albany.  A "V" is currently visited; a digit shows the
depth of a vertex that is marked visited; a "*" is a vertex which we try to
visit but discover has already been visited.  Underneath each figure of the
graph, I depict the queue and the current value of the variable "v" in bfs().
</p>

<pre class="example">
V-K  0-V  0-1  *-1  0-1  *-1  0-*  0-1  0-1  0-1  0-1  0-1  0-1  0-1  0-1  0-1
 \|   \|   \|   \|   \|   \|   \|   \|   \|   \|   \|   \|   \|   \|   \|   \|
E-B  E-B  E-V  E-1  E-*  E-1  E-1  V-1  2-1  2-*  2-1  *-1  2-*  2-1  2-1  2-1
|/   |/   |/   |/   |/   |/   |/   |/   |/   |/   |/   |/   |/   |/   |/   |/
O-P  O-P  O-P  O-P  O-P  O-P  O-P  O-P  V-P  2-P  *-P  2-P  2-P  2-V  *-3  2-3

===  ===  ===  ===  ===  ===  ===  ===  ===  ===  ===  ===  ===  ===  ===  ===
A    K    KB   B    B              E    EO   O    O              P
===  ===  ===  ===  ===  ===  ===  ===  ===  ===  ===  ===  ===  ===  ===  ===
     v=A  v=A  v=K  v=K  v=B  v=B  v=B  v=B  v=E  v=E  v=O  v=O  v=O  v=P

</pre>

<pre class="example">
After we finish, we can find the shortest path from any vertex to the     0&lt;--1
starting vertex by following the parent pointers (right).  These           ^
pointers form a tree rooted at the starting vertex.  Note that they         \
point in the direction _opposite_ the search direction that got us there.    \
                                                                          2--&gt;1
Why does this work?  The starting vertex is enqueued first, then all the     ^
vertices at a distance of 1 from the start, then all the vertices at a      /
distance of 2, and so on.  Why?  When the starting vertex is dequeued,     /
all the vertices at a distance of 1 are enqueued, but no other vertex     2&lt;--3
is.  When the depth-1 vertices are dequeued and processed, all the
vertices at a distance of 2 are enqueued, because every vertex at a distance of
2 must be reachable by a single edge from some vertex at a distance of 1.  No
other vertex is enqueued, because every vertex at a distance less than 2 has
been marked, and every vertex at a distance greater than 2 is not reachable by
a single edge from some vertex at a distance of 1.

</pre>

<p>
<b>Recommendation</b>: pull out a piece of paper, draw a graph and a program stack,
and simulate BFS, with you acting as the computer and executing bfs() line by
line. You will understand it much better after taking the time to do this.
</p>

<p>
BFS, like DFS, runs in <code>O(|V| + |E|)</code> time if you use an adjacency list;
<code>O(|V|^2)</code> time if you use an adjacency matrix.
</p>
</div>
</div>
