UCB_CS61_lec29.org
* Weighted Graphs
A weighted graph is a graph in which each edge is labeled with a numerical
weight. A weight might express the distance between two nodes, the cost of
moving from one to the other, the resistance between two points in an electrical
circuit, or many other things.

In an adjacency matrix, each weight is stored in the matrix.  Whereas an
- unweighted graph uses an array of booleans;
- weighted graph uses an array of ints, doubles, or some other numerical type.

Edges missing from the graph can
be represented by a special number like Integer.MIN_VALUE, at the cost of
declaring that number invalid as an edge weight.  (If you want to permit every
int to be a valid edge weight, you might use an additional array of booleans
as well.)

In an adjacency list, recall that each edge is represented by a listnode.  Each
listnode must be enlarged to include a weight, in addition to the reference to
the destination vertex.  (If you're using an array implementation of lists,
you'll need two separate arrays:  one for weights, and one for destinations.)

There are two particularly common problems involving weighted graphs.

One is the _shortest_path_problem_.
Suppose a graph represents a highway map,
and each road is labeled with the amount of time it takes to drive from one
interchange to the next. What's the fastest way to drive from Berkeley to Los
Angeles? A shortest path algorithm will tell us. You'll learn several of these
algorithms if you take CS 170.

The second problem is constructing a _minimum_spanning_tree_.
Suppose that you're wiring a house for electricity. Each node of the graph
represents an outlet, or the source of electricity. Every outlet needs to be
connected to the source, but not necessarily directly--possibly routed via
another outlet. The edges of the graph are labeled with the length of wire
you'll need to connect one node to another. How do you connect all the nodes
together with the shortest length of wire?

* [greedy algo]Kruskal's Algorithm for Finding Mimumum Spanning Trees           <<minimum spanning tree>>
Let ~G = (V, E)~ be an undirected graph. A _spanning_tree_ ~T = (V, F)~ of G is
a graph containing the same vertices as G, _and ~|V| - 1~ edges of G that form a
tree_. (Hence, there is exactly one path between any two vertices of T.)

If G is not connected, it has no spanning tree, but we can instead compute a
_spanning_forest_, or collection of trees, having one tree for each connected
component of G.

If G is weighted, then a _minimum spanning tree_ T of G is a spanning tree of G
whose total weight (summed over all edges of T) is minimal. In other words, no
other spanning tree of G has a smaller total weight.

Kruskal's algorithm computes the mimimum spanning tree of G as follows.

#+BEGIN_EXAMPLE
[1]  Create a new graph T with the same vertices as G, but no edges (yet).
[2]  Make a list of all the edges in G.
[3]  Sort the edges by weight, from least to greatest.
[4]  Iterate through the edges in sorted order.
     For each edge (u, w):
[4a]   If u and w are not connected by a path in T, add (u, w) to T.
这个意思就是由图，生成树(没有环路),然后确保整棵树的 weight 最小。
#+END_EXAMPLE


Because this algorithm never adds (u, w) if some path already connects u and w,
T is guaranteed to be a tree (if G is connected) or a forest (if G is not).

Why is T a minimum spanning tree in the end?

Suppose the algorithm is considering adding an edge (u, w) to T, and there is
not yet a path connecting u to w. Let U be the set of vertices in T that are
connected (so far) to u, and let W be a set containing all the other vertices,
including w. Let the _bridge_edges_ be any edges in G that have one end vertex
in U and one end vertex in W. Any spanning tree must contain at least one of
these bridge edges. As long as we choose a bridge edge with the least weight, we
are safe. (There may be several bridge edges with the same least weight, in
which case it doesn't matter which one we choose.)

#+BEGIN_EXAMPLE
+-------------+-----------------+-------------+  T
|             |                 |             |
| U           |    W            | other       |
|             |                 |             |
+---^---+-----+---------^--+----+-------------+
    |   |               |  |
    |   |connected      |  |connected
    |   |               |  |
    |   u               |  w
    |                   |
----+-------------------+--------------------------------------
    +---------------+   +--+                     G
                    |      |
                 ---+------+--
                (    E        )
                 -------------
#+END_EXAMPLE

Because we go through the edges of G in order by weight, (u, w) must have the
least weight, because it's the first edge we encountered connecting U to W.
(See Goodrich and Tamassia page 649 for a proof that choosing the bridge edge
with least weight is always the right thing to do.)

What is the running time of Kruskal's algorithm?

1. step [1] and [2],running time is O(|V|)
2. step [3],as we'll discover in the next two lectures, sorting |E| edges takes O(|E| log |E|) time.
3. step [4a], determining whether u and w are
   already connected by a path. The simplest way to do this is by doing a
   _depth-first search_ on T starting at u, and seeing if we visit w. But if we do
   that, Kruskal's algorithm might take _Theta(|E| |V|))_ time.
4. We can do better.  In Lecture 33, we'll learn how to solve that problem
   quickly, so that all the iterations of [4a] together take less than _O(|E| log |E|)_ time.

5. add 1~4 up:
   - If we use an adjacency list, the running time is in O(|V| + |E| log |E|).
     But |E| < |V|^2, so log |E| < 2 log |V|.
     Therefore, Kruskal's algorithm runs in O(|V| + |E| log |V|) time.
   - If we use an adjacency matrix, the running time is in O(|V|^2 + |E| log |E|),
     because it takes Theta(|V|^2) time simply to make a list of all the edges.
* [greedy algo]Prim's Algo for Finding minimum spanning tree
  minimum spanning tree 肯定是有 n 个节点，且有 n-1 条连接的这么个树。

  greedy algo: take the smallest as you can ,and keep adding.
  kruskal: let forest grow together.
  prim: let edge is connected to the tree you have started to grow
  let edge which is connected to the small tree that we've created.
  we could have a heap that has stored all the nodes, we are going
  to keep the smallest edge from that vertex to the frontier(可以理解为前线). we
  keep nodes on the heap that represents our frontier.

  #+BEGIN_EXAMPLE
  Prime algo, just pick a node randomly as root.
  need 2 arrays:
  parent array, the backer is the decendence, storing the tree simply by storing the
                partent, no left, no right. parent represents the current potential finge
  value array, how dose it cost to include this node into the spanning tree.
               we only change it if it do better,means an item of array will smaller.
       1 heap: candidates for the next node, 为什么需要 heap，注意 heap 的特点，可以用 O(1)的速度取出最大 or 最小值。
               这里就可以从 candidates 中取出最小值。
               heap store all nodes in it,
  #+END_EXAMPLE

  running time: ~n + nlogn + elogn~


  注意，这里使用的是 heap + 2 arrays， 这种方法适用于稀疏矩阵。还可以使用二维矩
  阵， 他的复杂度最差是 O(n^2), 适合于非稀疏矩阵。
