UCB_CS61_lec29.org
* Shortest path tree and Distances
  #+BEGIN_EXAMPLE
               B -----1------ F
             /   \          / |
            /     \        4  |
           2       2      /   |
          /         \    /    |
         /           \  /     1
         A ----1----- C       |
         \          / \       |
          \        /   \      |
           1      4     3     |
            \    /       \    |
             \  /         \   |
              \/           \  |
               D -----2----- E

  #+END_EXAMPLE


1) $ = infinite
  #+BEGIN_EXAMPLE
                                  array Dist                   array Parent
       B -----1------ F          A|  0   |                      A| nil |
     /   \          / |          B|  $   |                      B|     |
    /     \        4  |          C|  $   |                      C|     |
   4       2      /   |          D|  $   |                      D|     |
  /         \    /    |          E|  $   |                      E|     |
 /           \  /     1          F|  $   |                      F|     |
,*A ----1----- C       |
 \          / \       |
  \        /   \      |
   1      4     3     |
    \    /       \    |
     \  /         \   |
      \/           \  |
       D -----2----- E

  #+END_EXAMPLE

2) go from A to all nodes adjacented, record distance in Dist and parent in
   Parent then, cut A off, to guarantee every node will be visited ONLY ONCE.
   #+BEGIN_EXAMPLE
                                   array Dist                   array Parent
        B -----1------ F         +A|  0   |+                    +A| nil |+
      /.  \          / |          B|  4   |                      B|  A  |
     /.    \        4  |          C|  1   |                      C|  A  |
    4.      2      /   |          D|  1   |                      D|  A  |
   /.        \    /    |          E|  $   |                      E|     |
  /.          \  /     1          F|  $   |                      F|     |
 ,*A ----1----- C       |
  \........../ \       |
   \.       /   \      |
    1.     4     3     |
     \.   /       \    |
      \. /         \   |
       \/           \  |
        D -----2----- E

   #+END_EXAMPLE

3) then, scan the node with smallest distance in Dist like (2) Dist[C] + CB <
   Dist[B], overwrite Dist[B] with 3, overwrite Parent[B] with C '$' changed
   with Dist[C] + C* cut C off, if scan finish
   #+BEGIN_EXAMPLE
                                  array Dist                   array Parent
       B -----1------ F         +A|  0   |+                    +A| nil |+
     /.  \.        ./ |          B|+4+,3 |                      B|+A+,C|
    /.    \.      .4  |         +C|  1   |+                    +C|  A  |+
   4.      \.    ./   |          D|  1   |                      D|  A  |
  /.        \.  ./    |          E|+$+,4 |                      E|  C  |
 /.          \../     1          F|+$+,5 |                      F|  C  |
,*A ----1----- *C      |
 \........../.\.      |
  \.       /.  \.     |
   1.     4.    3.    |
    \.   /.      \.   |
     \. /.        \.  |
      \/.          \. |
       D -----2----- E

   #+END_EXAMPLE

4) then, scan the node smallest distance in Dist like (2) Dist[B] + BF <
    Dist[F], overwrite Dist[F] with 4, overwrite Parent[F] with B '$' changed
    with Dist[C] + C* cut C off, if scan finish

    #+BEGIN_EXAMPLE
         ............             array Dist                   array Parent
      ,*B -----1------ F        +A|  0      |+                 +A| nil     |+
     /.  \.        ./ |         +B|+4+,3    |+                 +B|+A+,C    |+
    /.    \.      .4  |         +C|  1      |+                 +C|  A      |+
   4.      2.    ./   |          D|  1      |                   D|  A      |
  /.        \.  ./    |          E|+$+,4    |                   E|  C      |
 /.          \../     1          F|+$+,+5+,4|                   F|+C+,B    |
,*A ----1----- *C      |
 \........../.\.      |
  \.       /.  \.     |
   1.     4.    3.    |
    \.   /.      \.   |
     \. /.        \.  |
      \/.          \. |
       D -----2----- E

(*) .... loop like upper steps, at last, then you will get the shottest distance
         in Dist array and the Path follow the Parent array.
    #+END_EXAMPLE

